; domain
(define (domain n-puzzle-typed)
  (:requirements :typing)
  (:types position tile)
  (:predicates (at ?tile - tile ?position - position)
	       (neighbor ?p1 - position ?p2 - position) 
	       (empty ?position - position)
   )

  (:action move
     :parameters (?tile - tile ?from ?to - position)
     :precondition (and (neighbor ?from ?to)
			(at ?tile ?from)
			(empty ?to))
     :effect (and (at ?tile ?to) (empty ?from) 
		  (not (at ?tile ?from)) (not (empty ?to)))
  )
)

; problem
(define (problem n-puzzle-n2-s99699)
(:domain n-puzzle-typed)
  (:objects p_1_1 p_1_2 p_2_1 p_2_2 - position t_1 t_2 t_3 - tile)
  (:init
    (at t_2 p_1_1)
    (at t_3 p_1_2)
    (at t_1 p_2_1)
    (empty p_2_2)
    (neighbor p_1_1 p_1_2)
    (neighbor p_1_2 p_1_1)
    (neighbor p_2_1 p_2_2)
    (neighbor p_2_2 p_2_1)
    (neighbor p_1_1 p_2_1)
    (neighbor p_2_1 p_1_1)
    (neighbor p_1_2 p_2_2)
    (neighbor p_2_2 p_1_2))
  (:goal (and
    (at t_1 p_1_1)
    (at t_2 p_1_2)
    (at t_3 p_2_1))))

; plan
1. (move t_3 p_1_2 p_2_2)
   deleted: (at t_3 p_1_2) (empty p_2_2)
   added: (at t_3 p_2_2) (empty p_1_2)
   goals met: 0 of 3
2. (move t_2 p_1_1 p_1_2)
   deleted: (at t_2 p_1_1) (empty p_1_2)
   added: (at t_2 p_1_2) (empty p_1_1)
   goals met: 1 of 3
3. (move t_1 p_2_1 p_1_1)
   deleted: (at t_1 p_2_1) (empty p_1_1)
   added: (at t_1 p_1_1) (empty p_2_1)
   goals met: 2 of 3
4. (move t_3 p_2_2 p_2_1)
   deleted: (at t_3 p_2_2) (empty p_2_1)
   added: (at t_3 p_2_1) (empty p_2_2)
   goals met: 3 of 3
